---
kind: type
id: T:Autodesk.Revit.DB.PaperSizeSet
source: html/937541cf-98ae-ef55-c74b-1e03f63698b4.htm
---
# Autodesk.Revit.DB.PaperSizeSet

A set that can contain any number of paper size objects.

## Syntax (C#)
```csharp
public class PaperSizeSet : APIObject,
	IEnumerable
```